# FabricationInsulationAbbreviation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationInsulationAbbreviation Property
ParameterTypeId Class See Also
---
"Insulation Abbreviation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationInsulationAbbreviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationInsulationAbbreviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationInsulationAbbreviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace